Documents/СчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактура</Name>
			<BasedOn>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыПолученного</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыСчетовФактур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСчетовФактур</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СчетФактура/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы      = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	Элементы.ДатаСчетаФактурыПолученного.Видимость = 
		ДанныеОбъекта.ТипСчетаФактуры = ПредопределенноеЗначение("Перечисление.ТипыСчетовФактур.Полученный");
		
	Элементы.КомандаПрисвоитьНомерСчетаФактурыВыданного.Видимость = 
		ДанныеОбъекта.ТипСчетаФактуры = ПредопределенноеЗначение("Перечисление.ТипыСчетовФактур.Выданный");
		
	Элементы.Грузоотправитель.Видимость = Форма.ГрузоотправительНужен;
	
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();
		
		ПутьКДаннымСкрываемыхПолей.Вставить("Грузоотправитель"  			, "Объект.Грузоотправитель");
		ПутьКДаннымСкрываемыхПолей.Вставить("НомерСчетаФактуры" 		 	, "Объект.НомерСчетаФактуры");
		ПутьКДаннымСкрываемыхПолей.Вставить("ДатаСчетаФактурыПолученного"  	, "Объект.ДатаСчетаФактурыПолученного");
			
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);
		
	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьИДоступность

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЭтаФорма.ГрузоотправительНужен = ЗначениеЗаполнено(Объект.Грузоотправитель);
	ОбновитьКПП();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСчетаФактурыПриИзменении(Элемент)
	
	Если Объект.ТипСчетаФактуры <> ПредопределенноеЗначение("Перечисление.ТипыСчетовФактур.Полученный") Тогда
		Объект.ДатаСчетаФактурыПолученного = Дата(1,1,1,0,0,0);
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура КомандаПрисвоитьНомерСчетаФактурыВыданногоНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ОбъектНаСервере.НомерСчетаФактуры = РаботаСНДС.ПолучитьНомерСчетаФактуры(ОбъектНаСервере);
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура КомандаПрисвоитьНомерСчетаФактурыВыданного(Команда)
	
	КомандаПрисвоитьНомерСчетаФактурыВыданногоНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОснованияСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС(Элементы.Основания.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте 
Процедура РассчитатьСуммуНДС(ТекущиеДанные)
	
	СтавкаНДС = РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(ТекущиеДанные.СтавкаНДС);

	ТекущиеДанные.СуммаНДС = ТекущиеДанные.СуммаСНДС * СтавкаНДС/(100 + СтавкаНДС);
	
КонецПроцедуры	


&НаКлиенте
Процедура ОснованияСуммаСНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС(Элементы.Основания.ТекущиеДанные);

КонецПроцедуры

&НаСервере
Процедура ОбновитьКПП()
	
	ЭтаФорма.КПП = "";

	Если ЗначениеЗаполнено(Объект.Контрагент) ИЛИ ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КППКрупнейшегоНалогоплательщика <> """"
			|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.КППКрупнейшегоНалогоплательщика
			|		ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.КПП
			|	КОНЕЦ КАК КПП
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			&Дата,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("ЮрФизЛицо", ?(ЗначениеЗаполнено(Объект.Грузоотправитель), Объект.Грузоотправитель, Объект.Контрагент));
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЭтаФорма.КПП = ВыборкаДетальныеЗаписи.КПП;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительНуженПриИзменении(Элемент)
	
	Если НЕ ГрузоотправительНужен Тогда
		Объект.Грузоотправитель = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		ЭтаФорма.Модифицированность = Истина;
		ОбновитьКПП();
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	ОбновитьКПП();
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьКПП();
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры
